a = 20 #Змінна А
b = 6 #Змінна В

print("БАЗОВИЙ КАЛЬКУЛЯТОР:") #Вивід результатів
print(a, "+", b, "=", a + b) #Додавання змінних
print(a, "-", b, "=", a - b) #Віднімання змінних
print(a, "*", b, "=", a * b) #Множення змінних
print(a, "/", b, "=", a / b)   #Ділення змінних
print(a, "//", b, "=", a // b) #Цілочисельне ділення змінних
print(a, "**", b, "**", a ** b) #Підведення до степеня змінних
print("-" * 30)

#Використання складених операторів
print("РОБОТА З ЛІЧИЛЬНИКОМ::") #Вивід результатів
score = 0
print("Початкове число:", score)
score += 10
print("+ 10 :", score) #Додали 10
score += 5
print("+ 5 :", score) #Додали ще 5
score -= 3
print("-3 :", score) #Відняли 3
score *= 2
print("*2 :", score) #Помножили на 2
print("-" * 30)

total = 99.99 * 1.20
rounded_total = round(total, 2) #Округлення до сотих
print("РОБОТА З ВБУДОВАНИМИ ФУНКЦІЯМИ:") #Вивід результатів
print("Сума без округлення:", total) #Вивід числа без округлення
print("Сума округлена:", rounded_total) #Вивід числа з округленням
print("-" * 30)

#Пошук екстремумів
math_score = 11 #Оцінка з математики
biology_score = 9 #Оцінка з біології
history_score = 12 #Оцінка з історії

best = max(math_score, biology_score, history_score) #Пошук максимума
worst = min(math_score, biology_score, history_score) #Пошук мімнімума

print("РЕЗУЛЬТАТИ ПОШУКА ЕКСТРЕМУМА") #Вивід результатів
print("Оцінки: 11, 9, 12") #Вивід всіх оцінок
print("Найкращий результат:", best) #Вивід найкращої оцінки
print("Найгірший результат:", worst) #Вивід найгіршої оцінки
print("-" * 30)

