width = 12 #Ширина прямокутника
height = 5 #Висота прямокутника

area = width * height #Формула для розрахунку площі
perimeter = 2 * (width + height) #Формула для розрахунку периметра

print("ЗВІТ ПРЯМОКУТНИКА:") #Вивід результатів
print("-" * 30)
print("Ширина:", width, "см") #Вивід ширини прямокутника
print("-" * 30)
print("Висота", height, "см") #Вивід висоти прямокутника
print("-" * 30)
print("Площина:", area, "см²") #Вивід площини прямокутника
print("-" * 30)
print("Периметр:",perimeter, "см²") #Вивід периметра прямокутника